class ShowBookData {
  static List showBookData = [
    {
      'first':
          'اليوم واحد من حيث كونه يوقا ، ففي كل الأحوال نحن نملك نفس الساعات والدقائق .. أليس كذلك ؟ فرغم اتفاقنا في هذا الأمر تجد أن هناك من يعمل وينجز الأعمال والمشاريع العظيمة ومن تتراكم عليه الأعمال والواجبات حتى يتركها أو يفعل ما يقع تحت يده على عجالة وتحت ضغط في أحسن الأحوال .',
      'sec':
          'تجد من يتحدث عما أنجز وعقا محط أن ينجز ، وتجد من ينتظر تهيئة الظروف وسنوح الفرص حتى يبدأ وينجز خططه ومشاريعه وأهدافه العظام ، فما الذي اختلف بين هذا وذاك على كل حال ؟ فما اختلف على الحقيقة هو عاداتهم وطرق إدارتهم للوقت خصوصا وللحياة عموها . هذا ما أراد الكاتب توضيحه ، وقام باستعراضه بين طيات الكتاب فهو يوضح لك بعض الأخطاء التي قد تصادفك في إدارتك لوقتك',
      'third':
          'ويستعرض بعض الحلول لمشكلة التسويف والمماطلة . ويقدم بعض النصائح النافعة التي تعينك على إدارة وقتك على نحو صحيح ، واضعا بين يديك خلاصة تجاربه الذاتية حيال إدارة الوقت , قراءة وتطبيقات .',
      'for': 'لمن هذا الكتاب ؟',
      'forContain': [
        'لمن يعانون التسويف والمماطلة ',
        'اللساعين نحو حياة عملية أفضل',
        'لكل من يهتم بتنظيم الوقت وإدارة الحياة'
      ],
      'writer': 'معلومات عن المؤلف ',
      'writerContaine': [
        'بريان تريسي Brian Tracy : مؤلف ومتحدث تحفيزي أمريكي من أصل كندي',
        'له العديد من الكتب والمؤلفات في مجال تطوير الذات , وأهمها',
        ' الإنجاز الأكبر',
        'علم نفس الإنجاز ',
        'استراتيجيات البيع المتقدمة القوانين المئة المطلقة في إنجاح الأعمال',
      ],
    }
  ];
}
