import 'package:flutter/material.dart';

class DataSource {
  static List<Map<String, dynamic>> departInfo = [
    {'name': 'النمو الشخصى', 'icon': Icons.insert_chart},
    {
      'name': 'السياسة والإقتصاد',
      'icon': Icons.monetization_on,
    },
    {'name': 'ريادة الأعمال', 'icon': Icons.work},
    {
      'name': 'التسويق والمبيعات',
      'icon': Icons.person_outline,
    },
    {'name': 'الصحة واللياقة', 'icon': Icons.fitness_center},
    {'name': 'القيادةوالإدارة', 'icon': Icons.headset_mic},
    {'name': 'مهارات التواصل', 'icon': Icons.people},
    {'name': 'الفكر والفلسفه', 'icon': Icons.chat},
    {'name': 'المال والاستثمار', 'icon': Icons.payment},
    {'name': 'علوم إسلامية', 'icon': Icons.near_me},
    {'name': 'نفس واجتماع', 'icon': Icons.person_add},
    {'name': 'السير والتاريخ', 'icon': Icons.playlist_add},
    {'name': 'العلوم والمعارف', 'icon': Icons.settings_input_composite},
    {'name': 'الأبوة والأمومه', 'icon': Icons.child_care},
    {'name': 'العلاقات العاطفية', 'icon': Icons.favorite},
    {'name': 'التكنولوجيا والمستقبل', 'icon': Icons.filter_center_focus},
  ];
  static List namesDepart = [
    'النمو الشخصى',
    'السياسة والإقتصاد',
    'ريادة الأعمال',
    'التسويق والمبيعات',
    'الصحة واللياقة',
    'القيادةوالإدارة',
    'مهارات التواصل',
    'الفكر والفلسفه',
    'المال والاستثمار',
  ];
  static List iconDepart = [
    Icons.insert_chart,
    Icons.monetization_on,
    Icons.work,
    Icons.person_outline,
    Icons.fitness_center,
    Icons.headset_mic,
    Icons.people,
    Icons.payment,
    Icons.favorite,
  ];
  static List booksInfo = [
    {
      'name': 'علم نفس قرانى',
      'imgurl': 'non',
      'writer': 'مصطفي محمود',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'روح الإجتماع',
      'imgurl': 'non',
      'writer': 'غوستاف لوبون',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'علم النفس الشرعى',
      'imgurl': 'non',
      'writer': 'ديفيد كانتر',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'المرشد في طب النفس',
      'imgurl': 'non',
      'writer': ' نخبة من أستاذة الطب النفسي',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'السعادة تنبع من الداخل ',
      'imgurl': 'non',
      'writer': 'جان باول اليسوعى',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'دماغك تحت تأثير الاجابية ',
      'imgurl': 'non',
      'writer': 'جاري ويلسون',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'الهشاشة النفسيه',
      'imgurl': 'non',
      'writer': 'الين مازليش واديل نابلر',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': ' أدر مهامك اليومية',
      'imgurl': 'non',
      'writer': 'جوسلين كية جلاى',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': ' نظام التفاهة',
      'imgurl': 'non',
      'writer': 'ألان دونو',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
  ];
}
