import 'package:flutter/material.dart';

class DataSource {
  static List namesDepart = [
    'النمو الشخصى',
    'السياسة والإقتصاد',
    'ريادة الأعمال',
    'التسويق والمبيعات',
    'الصحة واللياقة',
    'القيادةوالإدارة',
    'مهارات التواصل',
    'المال والاستثمار',
  ];
  static List iconDepart = [
    Icons.insert_chart,
    Icons.monetization_on,
    Icons.work,
    Icons.person_outline,
    Icons.fitness_center,
    Icons.headset_mic,
    Icons.people,
    Icons.speaker_notes,
    Icons.payment,
  ];
  static List booksInfo = [
    {
      'name': 'علم نفس قرانى',
      'imgurl': 'non',
      'writer': 'مصطفي محمود',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'روح الإجتماع',
      'imgurl': 'non',
      'writer': 'غوستاف لوبون',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'علم النفس الشرعى',
      'imgurl': 'non',
      'writer': 'ديفيد كانتر',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'المرشد في طب النفس',
      'imgurl': 'non',
      'writer': ' نخبة من أستاذة الطب النفسي',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
    {
      'name': 'السعادة تنبع من الداخل ',
      'imgurl': 'non',
      'writer': 'جان باول اليسوعى',
      'content':
          'لا شك ان هناك اختلافا بين علم النفس والدين في علاج الأمراض النفسية .فعلم النفس لا يري إمكنا لتبديل النفس أو تغيرها جوهرياز لأنها تأخذ شكلها النهائي في السنوات الخمس الأولى من الطفولة ....',
    },
  ];
}
